# Задача 28: Напишите рекурсивную функцию sum(a, b),
# возвращающую сумму двух целых неотрицательных чисел. Из
# всех арифметических операций допускаются только +1 и -1.
# Также нельзя использовать циклы.
# 2 2
# 4

def sumNum (a,b):
    if a == 0:
        return b
    else: return sumNum(a-1, b+1)

a = int (input ("Введите число А = "))
b = int (input ("Введите число B = "))
print (f" -> {sumNum(a,b)}")