# Задача 16: Требуется вычислить, сколько раз встречается некоторое
# число X в массиве A[1..N]. Пользователь в первой строке вводит
# натуральное число N – количество элементов в массиве. В последующих
# строках записаны N целых чисел Ai
# . Последняя строка содержит число X
# 5
# 1 2 3 4 5
# 3
# -> 1

n = int (input("Введите число элементов массива: "))
x = int (input("Введите число, которое нужно найти: "))
A = [int(input("Введите число: ")) for i in range(n)]
counter = 0
print(A)
for i in range (n):
    if A[i]== x:
        counter+=1
        i+=1
print (counter)