# Задача 18: Требуется найти в массиве A[1..N] самый близкий по
# величине элемент к заданному числу X. Пользователь в первой строке
# вводит натуральное число N – количество элементов в массиве. В
# последующих строках записаны N целых чисел Ai
# . Последняя строка
# содержит число X
# 5
# 1 2 3 4 5
# 6
# -> 5


import random
n = int (input ("Введите количество элементов массива: "))
x = int (input ("Введите заданное число: "))
A = [random.randint(1,20) for _ in range (n)]
print (A)
closNum = A[0]
for i in range(1, n):
    if abs(A[i] - x) < abs(closNum - x):
        closNum = A[i]

print(closNum)