# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, 
# а некоторые – гербом. Определите минимальное число монеток, которые нужно перевернуть, 
# чтобы все монетки были повернуты вверх одной и той же стороной. 
# Выведите минимальное количество монет, которые нужно перевернуть..
# 5 -> 1 0 1 1 0
# 2

n = int (input("Введите количество монеток: "))
coinTail = 0
coinEagle = 0
for i in range(n):
    k = int (input ("Введите 1 для монеты вверх гербом или 0 для  монеты вверх решкой: "))
    i += 1
    if k == 1 or k == 0:
        if k == 1:
            coinEagle+=1
        elif k == 0:
            coinTail+=1
    else:
        print("Надо вводить только 0 или 1. Попробуйте снова!")
        break
if coinTail >= coinEagle:
    print (f"Необходимо перевернуть {coinEagle} монет")
else:
    print (f"Необходимо перевернуть {coinTail} монет")