# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на
# круглой грядке, причем кусты высажены только по окружности. Таким образом, у
# каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
# выросло различное число ягод – на i-ом кусте выросло ai
#  ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым
# кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может
# собрать за один заход собирающий модуль, находясь перед некоторым кустом
# заданной во входном файле грядки

# 4 -> 1 2 3 4
# 9
n = int (input ("Введите количество кустов на грядке: "))
my_list = []
for i in range(n):
    num = int(input(f'Введите количество ягод для куста {i + 1}: '))
    my_list.append(num)
print(my_list)
for i in range (len(my_list)-2):
    maxSum = my_list[-2]+ my_list[-1]+ my_list[0]
    curSum = my_list[i] + my_list[i+1]+my_list[i+2]
    if maxSum < curSum:
        maxSum = curSum
        i+= 1
    else: i+= 1
print (maxSum)

